app/controllers/preferences_controller.rb

  def update

    @preference = get_preference()
    @preference.shop_url = session[:shopify_domain].to_s

    shipping_methods_long_desc_int = params.require('shipping_methods_long_desc_int').permit(:INT_PARCEL_COR_OWN_PACKAGING, :INT_PARCEL_EXP_OWN_PACKAGING, :INT_PARCEL_STD_OWN_PACKAGING, :INT_PARCEL_AIR_OWN_PACKAGING, :INT_PARCEL_SEA_OWN_PACKAGING)
    shipping_methods_allowed_int = params.require('shipping_methods_allowed_int').permit(:INT_PARCEL_COR_OWN_PACKAGING, :INT_PARCEL_EXP_OWN_PACKAGING, :INT_PARCEL_STD_OWN_PACKAGING, :INT_PARCEL_AIR_OWN_PACKAGING, :INT_PARCEL_SEA_OWN_PACKAGING)
    shipping_methods_allowed_dom = params.require('shipping_methods_allowed_dom').permit(:AUS_PARCEL_REGULAR,:AUS_PARCEL_EXPRESS,:AUS_PARCEL_REGULAR_SATCHEL_500G,:AUS_PARCEL_EXPRESS_SATCHEL_500G,:AUS_PARCEL_REGULAR_SATCHEL_3KG,:AUS_PARCEL_EXPRESS_SATCHEL_3KG,:AUS_PARCEL_REGULAR_SATCHEL_5KG, :AUS_PARCEL_EXPRESS_SATCHEL_5KG)
    shipping_methods_long_desc_dom = params.require('shipping_methods_long_desc_dom').permit(:AUS_PARCEL_REGULAR,:AUS_PARCEL_EXPRESS,:AUS_PARCEL_REGULAR_SATCHEL_500G,:AUS_PARCEL_EXPRESS_SATCHEL_500G,:AUS_PARCEL_REGULAR_SATCHEL_3KG,:AUS_PARCEL_EXPRESS_SATCHEL_3KG,:AUS_PARCEL_REGULAR_SATCHEL_5KG, :AUS_PARCEL_EXPRESS_SATCHEL_5KG)

    @preference[:shipping_methods_long_desc_int] = shipping_methods_long_desc_int.to_h || {}
    @preference[:shipping_methods_long_desc_dom] = shipping_methods_long_desc_dom.to_h || {}
    @preference[:shipping_methods_allowed_int] = shipping_methods_allowed_int.to_h || {}
    @preference[:shipping_methods_allowed_dom] = shipping_methods_allowed_dom.to_h || {}
    @preference.save
---
INSERT INTO "preference" ("shop_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["shop_url", "billsbigbucks.myshopify.com"], ["created_at", 2016-12-10 09:04:50 UTC], ["updated_at", 2016-12-10 09:04:50 UTC]]
UPDATE "preference" SET "shipping_methods_allowed_int" = $1, "shipping_methods_allowed_dom" = $2, "updated_at" = $3 WHERE "preference"."id" = $4  [["shipping_methods_allowed_int", nil], ["shipping_methods_allowed_dom", nil], ["updated_at", 2016-12-19 04:00:29 UTC], ["id", 2]]